Merge pull request #3 from TFMV/feature/spanner
Add Spanner
